Revit 2024 API
MEPAnalyticalSegmentType Enumeration
 The type of analytical segment.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Since: 2024
Syntax
C#
public enum MEPAnalyticalSegmentType
Visual Basic
Public Enumeration MEPAnalyticalSegmentType
Visual C++
public enum class MEPAnalyticalSegmentType
Members
Member name | Description
Undefined |  The segment is undefined.
Segment |  The segment is undefined.
Fitting |  The segment is fitting.
Pump |  The segment is pump.
Loss |  The terminal loss (e.g., radiator, coil, etc.)
SourceEquipment |  The source equipment (e.g., chiller, boiler, etc.)
See Also
Autodesk.Revit.DB.Analysis Namespace